fixtures/demo-configuration/src/DataProcessors/ПроведениеДокументов/ПроведениеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроведениеДокументов</name>
  <attributes>
    <name>СписокДокументов</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныеДокументы</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>Проводить</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fixtures/demo-configuration/src/DataProcessors/ПроведениеДокументов/ObjectModule.bsl
//Заполнение списка видов документов
Процедура ЗаполнитьСписок() Экспорт
	// Создание списка документов
	Для каждого МетаданныеДокумент Из Метаданные.Документы Цикл
		
		Если МетаданныеДокумент.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			СписокДокументов.Добавить(МетаданныеДокумент.Имя, МетаданныеДокумент.Представление());
		КонецЕсли;	
		
	КонецЦикла;	
	СписокДокументов.СортироватьПоПредставлению();
	
	Проводить = "Проведенные";
	
КонецПроцедуры	

//Проведение документов из имеющегося списка
Процедура Провести(ДатаНачала, ДатаОкончания, ТекущееКоличествоПроведенных) Экспорт
	
	Для каждого ДокументСписка Из ВыбранныеДокументы Цикл
		
		Выборка = Документы[ДокументСписка.Значение].Выбрать(ДатаНачала, ДатаОкончания);
		
		Пока Выборка.Следующий() Цикл
			
			Если Проводить = "Проведенные" И НЕ Выборка.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			Если Проводить = "НеПроведенные" И Выборка.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			Объект = Выборка.ПолучитьОбъект();
			Объект.Записать(РежимЗаписиДокумента.Проведение);
			ТекущееКоличествоПроведенных = ТекущееКоличествоПроведенных + 1;
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры
